InformationRegisters/CounterpartyProductsAndServicesPrices.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>CounterpartyProductsAndServicesPrices</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Price</Name>
					<Comment>Price</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Actuality</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>MeasurementUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.UOMClassifier</v8:Type>
						<v8:Type>cfg:CatalogRef.UOM</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentRecorder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>CounterpartyPriceKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CounterpartyPriceKind</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ProductsAndServices</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServices</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Characteristic</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServicesCharacteristics</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ProductsAndServicesTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>ProductsAndServicesTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>InventoryItem</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Service</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Work</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Operation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WorkKind</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DeleteExpense</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/CounterpartyProductsAndServicesPrices/Forms/ListForm/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// PROCEDURE - FORM EVENT HANDLERS

&AtServer
// Procedure-handler of the OnCreateAtServer event.
// Performs initial attributes forms filling.
//
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Property("Filter") AND Parameters.Filter.Property("ProductsAndServices") Then
		
		ProductsAndServices = Parameters.Filter.ProductsAndServices;
		
		If ProductsAndServices.ProductsAndServicesType <> Enums.ProductsAndServicesTypes.InventoryItem Then
			
			AutoTitle = False;
			Title = NStr("en='Counterparties prices can be entered only for the items with the Inventory type';ru='Цены контрагентов можно вводить только для номенклатуры с типом Запас'");
			
			Items.List.ReadOnly = True;
			
		EndIf;
		
	EndIf;
	
EndProcedure // OnCreateAtServer()


// Rise { Popov N 2016-05-25
&AtClient
Function RiseGetFormInterfaceClient() Export
	Return RiseGetFormInterface();
EndFunction

&AtServer
Function RiseGetFormInterface()
	Return RiseTranslation.GetFormInterface(ThisForm);
EndFunction
// Rise } Popov N 2016-05-25
